# Aula 12. Pandas
<img  src= "img/pandas1.jpeg" style="width:500px; height:500px">

Pandas é uma das bibliotecas mais utilizadas em Python para manipulação e análise de dados. Esta biblioteca é de código aberto, escrita em Numpy e oferece estruturas e operações para manipulação de tabelas numéricas e séries temporais.

Os principais destaques são:
- Possui dois tipos de objetos `pandas.core.frame.DataFrame` e `pandas.core.series.Series` com indexação integrada;
- Facilita a leitura, escrita e modificação de arquivos com diferentes formatos, entre os quais se destaca .csv, .txt, .xlsx, SQL, HDF5 (Hierarchical Data Format version 5) dentre outros;
- Permite tabelas com diferentes niveis de indexação;
- Permite agrupamento de dados por categorias;
- Realiza mesclagem e junção de conjuntos de dados com alto desempenho;
- Altamente otimizado com códigos escritos em Cython e C;
- Pandas é amplamente utilizado em ambientes acadêmicos e comerciais, incluindo finanças, neurociência, economia, estatística, publicidade, análise da web e muito mais.
---
Os tópicos que vamos abordar nesta série de conversar são
- Instalação de pandas;
- Importando pandas;
- Series;
- DataFrame e manipulação;
 - Criação de DataFrame;
 - Extraindo informação por colunas. CUIDADO COM NOTAÇÃO SQL;
 - Extraindo utilizando função loc;
 - Extraindo utilizando função iloc;
 - Adicionando novas colunas;
 - Adicionando novas filas (função append);
 - Eliminando colunas ou filas.
- Operadores de comparação e seleção condicional;
- Dados ausentes;
 - Dropna
 - filna
 - replace
- GroupBy
- concatenação
- Operação
- Importando e exportando dados.
- Aplicação
---
Recomento visitar o site oficial do projeto [Pandas](https://pandas.pydata.org/) para conhecer mais um pouco.

## Intalação do pandas

Para instalar pandas no nosso computador podemos utilizar o condas ou o pip.
```python
conda install pandas
pip install pandas
```

## importando pandas e numpy

In [1]:
import pandas as pd
import numpy as np

## Series
O conceito principal de uma [Series](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.Series.html) em Pandas e trabalhar com vetores a partir do indice ou labels. A sintaxe para definir uma Series é:
```python
 pandas.Series(data=None, index=None, dtype=None, name=None, copy=False, fastpath=False)
```

In [2]:
# Definindo algumas variaveis que vamos utilizar
valores  = np.random.randn(1, 10).reshape(10,)
index_row = "A B C D E F G H I J".split(" ")
d = {key: value for key, value in zip(index_row, valores)}

In [5]:
d

{'A': 0.15305651961908812,
 'B': 0.21153782801105048,
 'C': 1.6808745508747314,
 'D': 1.1496787347954256,
 'E': -1.470054846589587,
 'F': -0.6721770724764765,
 'G': 1.3532990069558237,
 'H': 1.144829436794336,
 'I': -1.4828699750498682,
 'J': 0.73453926253763}

In [6]:
# Criando uma Series passando somente os valores
pd.Series(valores)

0    0.153057
1    0.211538
2    1.680875
3    1.149679
4   -1.470055
5   -0.672177
6    1.353299
7    1.144829
8   -1.482870
9    0.734539
dtype: float64

In [7]:
# Criando uma Series passando data e index
pd.Series(data=valores, index=index_row)

A    0.153057
B    0.211538
C    1.680875
D    1.149679
E   -1.470055
F   -0.672177
G    1.353299
H    1.144829
I   -1.482870
J    0.734539
dtype: float64

In [8]:
# Observemos que pomodes criar uma Series passando qualquer tipo de dados
pd.Series(index=valores, data=index_row)

 0.153057    A
 0.211538    B
 1.680875    C
 1.149679    D
-1.470055    E
-0.672177    F
 1.353299    G
 1.144829    H
-1.482870    I
 0.734539    J
dtype: object

In [9]:
# Observemos que uma Series se comporta muito semelhante ao dicionário dado que ela trabalhar com chave: valor,
# portanto podemos criar uma Seires passando um dicionário
pd.Series(d)

A    0.153057
B    0.211538
C    1.680875
D    1.149679
E   -1.470055
F   -0.672177
G    1.353299
H    1.144829
I   -1.482870
J    0.734539
dtype: float64

Mas qual é a vantagem de utilizar uma Series em relação ao arrays?

In [11]:
series_1 = pd.Series(data=[5, 10, 20, 30, 8], index="A B C D J".split(" "))
series_2 = pd.Series(data=[20, 15, 15, 5, 25], index="A B K D C".split(" "))
print(series_1)
print(series_2)
print(series_1 + series_2)

A     5
B    10
C    20
D    30
J     8
dtype: int64
A    20
B    15
K    15
D     5
C    25
dtype: int64
A    25.0
B    25.0
C    45.0
D    35.0
J     NaN
K     NaN
dtype: float64

## DataFrame e manipulação
O objeto principal de Pandas é o [DataFrame](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.html), este objeto se aproxima ao que conhecemos como planilha de excell (somente em aparência). Para definir um DataFrame utilizamos a seguinte sintaxe:
```python
pandas.DataFrame(data=None, index=None, columns=None, dtype=None, copy=False)
```
Neste caso os argumentos mais relevantes são `data`, `index` e `columns`, porém o único argumento obrigatório é o `data`.

### Criação de DataFrame

In [12]:
data = np.arange(1, 17).reshape((4,4))
index = "Row_1 Row_2 Row_3 Row_4".split(" ")
col = "Col_1 Col_2 Col_3 Col_4".split(" ")

In [14]:
data

array([[ 1,  2,  3,  4],
       [ 5,  6,  7,  8],
       [ 9, 10, 11, 12],
       [13, 14, 15, 16]])

In [13]:
# Definindo um DataFrame passando data
pd.DataFrame(data)

    0   1   2   3
0   1   2   3   4
1   5   6   7   8
2   9  10  11  12
3  13  14  15  16

In [15]:
# Definindo um DataFrame passando data e index
pd.DataFrame(data, index)

        0   1   2   3
Row_1   1   2   3   4
Row_2   5   6   7   8
Row_3   9  10  11  12
Row_4  13  14  15  16

In [32]:
# Definindo um DataFrame passando todos data, index e columns
data_frame = pd.DataFrame(data, index, col)
data_frame

       Col_1  Col_2  Col_3  Col_4
Row_1      1      2      3      4
Row_2      5      6      7      8
Row_3      9     10     11     12
Row_4     13     14     15     16

### Extraindo informação por colunas. *CUIDADO COM NOTAÇÃO SQL*

In [17]:
# Extraindo informação da columna Col_4
data_frame["Col_4"]

Row_1     4
Row_2     8
Row_3    12
Row_4    16
Name: Col_4, dtype: int64

In [18]:
# Podemos utilizar a notação de ponto e o nome da columna, porém esta forma não é recomendada
data_frame.Col_3

Row_1     3
Row_2     7
Row_3    11
Row_4    15
Name: Col_3, dtype: int64

### Extraindo utilizando função loc
A propriedade [`loc`](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.loc.html) permite obter os dados de um DataFrame a partir dos labels das filas e das coluna. A sintaxe para aplicar esta propriedade é:
```python
DataFrame.loc[]
```

In [19]:
# Podemos utilizar a função loc para extrair informação utilizando o índice da fila e o nome da coluna
data_frame.loc["Row_1", "Col_1"]

1

In [26]:
# Para extrair diferentes colunas ou fila passamos uma lista com os nomes das colunas e filas
data_frame.loc[["Row_1", "Row_4"], ["Col_1", "Col_4"]]

       Col_1  Col_4
Row_1      1      4
Row_4     13     16

In [23]:
# Também podemos utilizar a função loc para extrair filas
data_frame.loc["Row_3"]

Col_1     9
Col_2    10
Col_3    11
Col_4    12
Name: Row_3, dtype: int64

### Extraindo utilizando função iloc
Existe outra forma de extrair os valores de um DataFrame utilizando a notação aprendida em Numpy, para isso utilizamos a propriedade [`iloc`](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.iloc.html):
```python
DataFrame.iloc[]
```

In [24]:
data_frame.iloc[0, 0]

1

In [25]:
data_frame.iloc[ [0, -1], [0, -1]]

       Col_1  Col_4
Row_1      1      4
Row_4     13     16

In [27]:
data_frame.iloc[2]

Col_1     9
Col_2    10
Col_3    11
Col_4    12
Name: Row_3, dtype: int64

In [28]:
data_frame.iloc[2:]

       Col_1  Col_2  Col_3  Col_4
Row_3      9     10     11     12
Row_4     13     14     15     16

### Adicionando novas colunas

In [29]:
data_frame["Col_nova"] = data_frame.iloc[:, -1] + data_frame.iloc[:, 0]
data_frame

       Col_1  Col_2  Col_3  Col_4  Col_nova
Row_1      1      2      3      4         5
Row_2      5      6      7      8        13
Row_3      9     10     11     12        21
Row_4     13     14     15     16        29

In [30]:
data_frame["Col_nova_2"]  = 2
data_frame

       Col_1  Col_2  Col_3  Col_4  Col_nova  Col_nova_2
Row_1      1      2      3      4         5           2
Row_2      5      6      7      8        13           2
Row_3      9     10     11     12        21           2
Row_4     13     14     15     16        29           2

In [31]:
data_frame

       Col_1  Col_2  Col_3  Col_4  Col_nova  Col_nova_2
Row_1      1      2      3      4         5           2
Row_2      5      6      7      8        13           2
Row_3      9     10     11     12        21           2
Row_4     13     14     15     16        29           2

### Adicionando novas filas (função append)
Para adicionar uma nova fila utilizamos a função [append()](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.append.html), essa função adiciona uma nova (ou novas) fila(s) no final do DataFrame. A sintaxe utilizada para isso é:
```python
DataFrame.append(other, ignore_index=False, verify_integrity=False, sort=False)
```

In [34]:
np.array([[1,2,3,4]])

array([[1, 2, 3, 4]])

In [41]:
data_frame2 = pd.DataFrame([[1,2,3,4]], columns=col)
data_frame.append(data_frame2)

       Col_1  Col_2  Col_3  Col_4
Row_1      1      2      3      4
Row_2      5      6      7      8
Row_3      9     10     11     12
Row_4     13     14     15     16
0          1      2      3      4

In [42]:
data_frame.append(data_frame*10)

       Col_1  Col_2  Col_3  Col_4
Row_1      1      2      3      4
Row_2      5      6      7      8
Row_3      9     10     11     12
Row_4     13     14     15     16
Row_1     10     20     30     40
Row_2     50     60     70     80
Row_3     90    100    110    120
Row_4    130    140    150    160

### Eliminando colunas ou filas
Para eliminar colunas ou filas de um DataFrame utilizamos a função [`drop`](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.drop.html). Neste caso se deve passar o indice da fila que será eliminada ou o label da coluna. Além disso, deve-se especificar o `axis` o qual é 0 para filas e 1 para columnas. A sintaxe utilizada é:

```python
DataFrame.drop(labels=None, axis=0, index=None, columns=None, level=None, inplace=False, errors='raise')
```

In [43]:
data_frame

       Col_1  Col_2  Col_3  Col_4
Row_1      1      2      3      4
Row_2      5      6      7      8
Row_3      9     10     11     12
Row_4     13     14     15     16

In [46]:
# Eliminando a primeira fila
data_frame.drop("Row_1", axis=0)

       Col_1  Col_2  Col_3  Col_4
Row_2      5      6      7      8
Row_3      9     10     11     12
Row_4     13     14     15     16

In [47]:
# Eliminando varias filas 
data_frame.drop(["Row_1", "Row_3"], axis=0)

       Col_1  Col_2  Col_3  Col_4
Row_2      5      6      7      8
Row_4     13     14     15     16

In [48]:
# Eliminando a primeira coluna
data_frame.drop("Col_1", axis=1)

       Col_2  Col_3  Col_4
Row_1      2      3      4
Row_2      6      7      8
Row_3     10     11     12
Row_4     14     15     16

In [51]:
data_frame

       Col_2  Col_3
Row_1      2      3
Row_2      6      7
Row_3     10     11
Row_4     14     15

In [50]:
# Eliminando a varias colunas coluna
data_frame.drop(["Col_1", "Col_4"], axis=1, inplace=True)

In [52]:
data_frame
# é interessante o fato de não modificar o data_frame original?

       Col_2  Col_3
Row_1      2      3
Row_2      6      7
Row_3     10     11
Row_4     14     15

## Operadores de comparação e seleção condicional
Da mesma forma que é possível aplicar operadores de comparação em arrays, com pandas podemos aplicar os mesmos operadores.

In [69]:
# Criando dados para trabalhar
np.random.seed(100)
data2 = np.random.randint(-10, 10, (5,5))
col2 = [f"Col_{i}" for i in range(1, 6)]
row2 = [f"Row_{i}" for i in range(1, 6)]
data_frame2 = pd.DataFrame(data2, row2, col2)
data_frame2

       Col_1  Col_2  Col_3  Col_4  Col_5
Row_1     -2     -7     -3      5      6
Row_2      0     -8     -8     -8      4
Row_3     -8      7      6      5     -6
Row_4      1      6     -1     -8      2
Row_5     -6     -9      3      9     -6

In [70]:
data_frame2 > 0

       Col_1  Col_2  Col_3  Col_4  Col_5
Row_1  False  False  False   True   True
Row_2  False  False  False  False   True
Row_3  False   True   True   True  False
Row_4   True   True  False  False   True
Row_5  False  False   True   True  False

In [76]:
# Podemos atribuir esse teste de comparação a uma variável e utiliza-o para realizar seleção
comp = data_frame2 > 0
data_frame2[comp] 
# data_frame2[data_frame2 > 0] 
data_frame2

       Col_1  Col_2  Col_3  Col_4  Col_5
Row_1     -2     -7     -3      5      6
Row_2      0     -8     -8     -8      4
Row_3     -8      7      6      5     -6
Row_4      1      6     -1     -8      2
Row_5     -6     -9      3      9     -6

In [77]:
# Aplicando uma comparação numa serie
comp = data_frame2["Col_5"] > 0
data_frame2[comp]["Col_1"]
data_frame2

       Col_1  Col_2  Col_3  Col_4  Col_5
Row_1     -2     -7     -3      5      6
Row_2      0     -8     -8     -8      4
Row_3     -8      7      6      5     -6
Row_4      1      6     -1     -8      2
Row_5     -6     -9      3      9     -6

In [79]:
# Aplicando comparaões multiplas
comp1 = data_frame2["Col_5"] >= 2 #(Row_1, Row_2 e Row_4)
comp2 = data_frame2["Col_3"] < -1 # (Row_1, Row_2)
data_frame2[comp2 & comp1]

       Col_1  Col_2  Col_3  Col_4  Col_5
Row_1     -2     -7     -3      5      6
Row_2      0     -8     -8     -8      4

In [81]:
# As tres linhas anteriores são equivalentes a:
data_frame2[(data_frame2["Col_5"] >= 2) & (data_frame2["Col_3"] < -1)]

       Col_1  Col_2  Col_3  Col_4  Col_5
Row_1     -2     -7     -3      5      6
Row_2      0     -8     -8     -8      4

In [ ]:
data_frame2

## Dados ausentes
Quando trabalhamos com dados provenientes de fontes externas (como base de dados, dados de sensores, etc), pode acontecer que existam dados com valores "inapropriados" ou valores ausentes. Nesse caso a biblioteca Pandas ajuda a processar esses valores.

Cabe destacar que o conceito de dado "inapropriado" varia de cenário para cenário e aforma de tratar esses dados pode varia. Porém Pandas possui uma diversa variedade de funções e metódos que podem ser utilizados para essa finalidade.

Recomendo a leitura de [Working with missing data](https://pandas.pydata.org/pandas-docs/stable/user_guide/missing_data.html). Nesta leitura a empresa desenvolvedora da biblioteca Pandas apresenta varias formas de processar dados ausentes.

In [82]:
# Criando data frame com valores nan
np.random.seed(100)
n = 10
data2 = np.random.randint(-10, 10, (n, n)).astype(object)
col2 = [f"Col_{i}" for i in range(1, n + 1)]
row2 = [f"Row_{i}" for i in range(1, n + 1)]
for r in range(n):
    for c in range(n):
        if np.random.random() < 0.25:
            data2[r, c] = np.nan
data_frame_nan = pd.DataFrame(data2, row2, col2)
data_frame_nan

       Col_1 Col_2 Col_3 Col_4 Col_5 Col_6 Col_7 Col_8 Col_9 Col_10
Row_1     -2    -7   NaN     5     6     0    -8    -8    -8      4
Row_2     -8     7     6   NaN    -6     1     6    -1    -8    NaN
Row_3     -6    -9     3     9    -6    -6    -7    -3     7      5
Row_4    NaN   NaN   NaN     6    -8   NaN     9    -8     4      7
Row_5      6     5    -3     3   NaN     2     8   -10    -8      0
Row_6      7   NaN     3     0   NaN   NaN     8    -2     9      4
Row_7    -10   NaN     2     0   NaN    -4   NaN     5     0    NaN
Row_8     -7   NaN     6     1    -6    -5    -3    -4    -8      0
Row_9      8   NaN     2    -9    -4     0   -10    -8     9     -6
Row_10     8   NaN   NaN    -1   NaN     6    -4    -5   NaN    NaN

### Dropna

Para excluir valores faltantes `NaN` utilizamos a função [`dropna`](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.dropna.html). Os argumentos necessarios para esta função são:

```python
DataFrame.dropna(axis=0, how='any', thresh=None, subset=None, inplace=False)
```

In [83]:
# Elimiando os valores NaN, observemos que o resultado é somente Row_3
# Neste caso definimos axis=0, o que indica que caso alguma fila tenha pelo menos um Nan, a fila será excluida
data_frame_nan.dropna(axis=0)

      Col_1 Col_2 Col_3 Col_4 Col_5 Col_6 Col_7 Col_8 Col_9 Col_10
Row_3    -6    -9     3     9    -6    -6    -7    -3     7      5

In [85]:
# Elimiando os valores NaN, observemos que o resultado é somente Col_8
# Neste caso definimos axis=0, o que indica que caso alguma fila tenha pelo menos um Nan, a fila será excluida
data_frame_nan.dropna(axis=1)

       Col_8
Row_1     -8
Row_2     -1
Row_3     -3
Row_4     -8
Row_5    -10
Row_6     -2
Row_7      5
Row_8     -4
Row_9     -8
Row_10    -5

In [86]:
# Também podemos definir a quantidade de valores no Nan que vamos aceitar. Por tanto se queremos aceitar
# pelo menos um NaN devemos de passar `thresh=9`
data_frame_nan.dropna(axis=1,thresh=9)

       Col_1 Col_4 Col_7 Col_8 Col_9
Row_1     -2     5    -8    -8    -8
Row_2     -8   NaN     6    -1    -8
Row_3     -6     9    -7    -3     7
Row_4    NaN     6     9    -8     4
Row_5      6     3     8   -10    -8
Row_6      7     0     8    -2     9
Row_7    -10     0   NaN     5     0
Row_8     -7     1    -3    -4    -8
Row_9      8    -9   -10    -8     9
Row_10     8    -1    -4    -5   NaN

In [89]:
# Observemos que a tabela original não foi modificada.
data_frame_nan

       Col_1 Col_3 Col_4 Col_6 Col_7 Col_8 Col_9 Col_10
Row_1     -2   NaN     5     0    -8    -8    -8      4
Row_2     -8     6   NaN     1     6    -1    -8    NaN
Row_3     -6     3     9    -6    -7    -3     7      5
Row_4    NaN   NaN     6   NaN     9    -8     4      7
Row_5      6    -3     3     2     8   -10    -8      0
Row_6      7     3     0   NaN     8    -2     9      4
Row_7    -10     2     0    -4   NaN     5     0    NaN
Row_8     -7     6     1    -5    -3    -4    -8      0
Row_9      8     2    -9     0   -10    -8     9     -6
Row_10     8   NaN    -1     6    -4    -5   NaN    NaN

In [88]:
# Se queremos modificar o arquivo original devemos passar `inplace=True`
data_frame_nan.dropna(axis=1,thresh=7, inplace=True)
data_frame_nan

       Col_1 Col_3 Col_4 Col_6 Col_7 Col_8 Col_9 Col_10
Row_1     -2   NaN     5     0    -8    -8    -8      4
Row_2     -8     6   NaN     1     6    -1    -8    NaN
Row_3     -6     3     9    -6    -7    -3     7      5
Row_4    NaN   NaN     6   NaN     9    -8     4      7
Row_5      6    -3     3     2     8   -10    -8      0
Row_6      7     3     0   NaN     8    -2     9      4
Row_7    -10     2     0    -4   NaN     5     0    NaN
Row_8     -7     6     1    -5    -3    -4    -8      0
Row_9      8     2    -9     0   -10    -8     9     -6
Row_10     8   NaN    -1     6    -4    -5   NaN    NaN

### fillna
Outra forma de processar os dados faltantes é utilizando a função [`fillna`](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.fillna.html) a qual permite substituir o valor faltante por outro valor.
```python
DataFrame.fillna(value=None, method=None, axis=None, inplace=False, limit=None, downcast=None)
```

In [ ]:
# Criando data frame com valores nan
np.random.seed(100)
n = 10
data2 = np.random.randint(25, 37, (n, n)).astype(object)
col2 = [f"Day_{i}" for i in range(1, n + 1)]
row2 = [f"Time_{i}" for i in range(1, n + 1)]
for r in range(n):
    for c in range(n):
        if np.random.random() < 0.25:
            data2[r, c] = np.nan
data_frame_fillna = pd.DataFrame(data2, row2, col2)
data_frame_fillna

In [ ]:
data_frame_fillna.fillna(value="VALOR ERRADO")

In [ ]:
# Caso queiramos preencher o valor faltante pelo valor anterior podemos realizar isso aplicando o `method="ffill"`
# Criando data frame com valores nan
np.random.seed(100)
n = 1440 # Equivalente a coleta de pontos cada 60 segundos por 24 h
r_n = 5
data2 = np.random.randint(27, 33, (n, r_n)).astype(object)
col2 = [f"Reactor_{i}" for i in range(1, r_n + 1)]
row2 = [f"Time_{i}" for i in range(1, n + 1)]
for r in range(data2.shape[0]):
    for c in range(data2.shape[1]):
        if np.random.random() < 0.25:
            data2[r, c] = np.nan
data_frame_fillna = pd.DataFrame(data2, row2, col2)
data_frame_fillna.info()
data_frame_fillna.describe()

In [ ]:
data_frame_fillna

In [ ]:
data_frame_fillna.fillna(method="ffill", inplace=True)

In [ ]:
data_frame_fillna

In [ ]:
data_frame_fillna.info()
data_frame_fillna.describe()

### replace
Uma das alternativas mais adequadas para trabalhar com valores ausentes ou inadequados é utilizando a função [`replace`](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.replace.html). Esta função trabalha de forma semelhante a `dropna` e `filna` porém agora podemos indicar qual ou quais valores queremos substituir. A sintaxe para o funcionamento deste método é:

```python
DataFrame.replace(to_replace=None, value=None, inplace=False, limit=None, regex=False, method='pad')
```

In [ ]:
# Vamos contiuar com data_frame_nan
data_frame_nan

In [ ]:
# Observemos que temos varios valores Nan
data_frame_nan.replace(to_replace=np.nan, value=10)

In [ ]:
# Podemos passar uma lista de valores para ser subtituido
data_frame_nan.replace(to_replace=[np.nan, 8], value=10)

In [ ]:
# E tambpém uma lista de valores para substuir
data_frame_nan.replace(to_replace=[np.nan, 8], value=[100, 80])

In [ ]:
# Voltando ao exemplo do sensor de temperatur
np.random.seed(100)
n = 1440 # Equivalente a coleta de pontos cada 60 segundos por 24 h
r_n = 3
err = [10, 15, 20, 40, 35]
data2 = np.random.uniform(27, 33, (n, r_n)).astype(object)
col2 = [f"Reactor_{i}" for i in range(1, r_n + 1)]
row2 = [f"Time_{i}" for i in range(1, n + 1)]
for r in range(data2.shape[0]):
    for c in range(data2.shape[1]):
        if np.random.random() < 0.25:
            data2[r, c] = np.nan
        elif np.random.random() < 0.05:
            data2[r, c] = np.random.choice(err)
data_frame_replace = pd.DataFrame(data2, row2, col2)

In [ ]:
data_frame_replace.columns

In [ ]:
import matplotlib.pyplot as plt
%matplotlib nbagg
for react in data_frame_replace.columns:
    fig, ax = plt.subplots()
    ax.plot(data_frame_replace[react].values,
             ls="-",
             c='black',
             marker="o", 
             markersize=1.0,
             markeredgecolor='blue',
             lw=0.1)
    ax.set_xlabel("Time")
    ax.set_ylabel("Temperature [°C]")
    ax.set_title(react)

In [ ]:
data_frame_replace.replace(to_replace=[40, 35, 20, 15, 10, np.nan], value=data_frame_replace.mean().mean() )

## Groupby
A função [`groupby`](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.groupby.html) é umas das função **mais importantes** da biblioteca Pandas devido a que permite realizar o agrupamento de grande quantidade de dados e aplicar funções sobre esses valores agrupados de forma rápida. Para aplicar essa função utilizamos a seguinte sintaxe:
```python
DataFrame.groupby(by=None, axis=0, level=None, as_index=True, sort=True, group_keys=True, squeeze=<object object>, observed=False, dropna=True)
```

In [153]:
# Para entender o funcionamento da função groupby vamos a criar uma matrix de dados
n = 1500
np.random.seed(100)
empresas = [f"Empresa {np.random.randint(1, 51)}" for _ in range(n)]
valor_investido = [np.random.uniform(500, 3500) for _ in range(n)]
retorno = [np.random.uniform(2000, 5000) for _ in range(n)]
transferencias = [np.random.randint(50, 150) for _ in range(n)]
matriz = np.c_[valor_investido, retorno, transferencias]
colum = "Valor investido ($R), Retorno ($R), Transferencias".split(", ")
#-----------------------------------------------------------------------
# Criação do DataFrame
data_frame_groupby = pd.DataFrame(data=matriz, columns=colum )
data_frame_groupby["Lucro ($)"] = data_frame_groupby["Retorno ($R)"] - data_frame_groupby["Valor investido ($R)"]
data_frame_groupby["Empresas"] = empresas
data_frame_groupby

,Valor investido ($R),Retorno ($R),Transferencias,Lucro ($),Empresas
0,2395.146139,2267.914842,147.0,-127.231297,Empresa 9
1,573.809911,4686.133772,138.0,4112.323860,Empresa 25
2,1595.693889,2063.509230,66.0,467.815341,Empresa 4
3,950.708543,3344.221121,114.0,2393.512577,Empresa 40
4,1867.941222,3312.663318,116.0,1444.722095,Empresa 24
...,...,...,...,...,...
1495,2485.341177,2692.370879,62.0,207.029702,Empresa 15
1496,840.284504,2700.582463,93.0,1860.297958,Empresa 37
1497,2250.217715,4771.450109,73.0,2521.232394,Empresa 46
1498,2396.891151,4391.564187,98.0,1994.673036,Empresa 15
1499,1280.946486,2904.981132,95.0,1624.034646,Empresa 17

In [151]:
# Para entender o conceito de Groupby, vamos agrupar os dados por empresas
dfgroupby = data_frame_groupby.groupby(by="Empresas")

In [154]:
# podemos aplicar uma serie de funções sobre o objeto que acabamos de criar
dfgroupby.mean()

             Valor investido ($R)  Retorno ($R)  Transferencias    Lucro ($)
Empresas
1. Empresa            1664.379181   3423.575079       92.466667  1759.195898
10. Empresa           2140.719171   3190.926190      100.814815  1050.207019
11. Empresa           2116.869748   3347.678176       90.678571  1230.808427
12. Empresa           1862.925647   3958.437340       91.086957  2095.511693
13. Empresa           1900.576222   3431.103574       94.969697  1530.527352
14. Empresa           1898.060800   3647.238621       88.678571  1749.177821
15. Empresa           2111.297602   3452.572584       89.243243  1341.274982
16. Empresa           1957.131902   3351.897950       92.000000  1394.766049
17. Empresa           1978.605630   3462.218560      106.028571  1483.612930
18. Empresa           1934.803192   3371.061402       97.833333  1436.258210
19. Empresa           2064.491394   3412.104318       97.085714  1347.612924
2. Empresa            1949.820838   3203.329748      102.290323  1253.508910
20. Empresa           1952.426107   3396.899169       99.875000  1444.473062
21. Empresa           1939.813657   3796.087643       95.882353  1856.273986
22. Empresa           1691.319432   3706.612504      101.222222  2015.293072
23. Empresa           1930.980263   3530.172001      101.483871  1599.191738
24. Empresa           1867.104460   3672.593560       91.542857  1805.489100
25. Empresa           2279.363359   3284.652650      100.954545  1005.289291
26. Empresa           1934.242327   3613.810166      102.948718  1679.567839
27. Empresa           1903.014538   3466.481127       96.807692  1563.466589
28. Empresa           1988.190438   3663.532360      100.433333  1675.341922
29. Empresa           2050.575235   3692.853863       96.297297  1642.278628
3. Empresa            2058.446066   3356.946477      109.032258  1298.500411
30. Empresa           1651.834766   3482.426739       99.520000  1830.591973
31. Empresa           1801.221926   3559.556194       92.242424  1758.334268
32. Empresa           2109.638914   3683.589719      102.777778  1573.950805
33. Empresa           1963.053862   3263.071559       97.535714  1300.017697
34. Empresa           2050.299310   3645.419372       95.157895  1595.120062
35. Empresa           1892.863328   3585.485089      101.909091  1692.621761
36. Empresa           2083.510154   3627.044944       97.575000  1543.534789
37. Empresa           1926.569348   3420.686900       95.483871  1494.117552
38. Empresa           1919.632242   3552.188514      100.410256  1632.556271
39. Empresa           1688.167153   3324.487385       92.800000  1636.320232
4. Empresa            1918.318963   3559.867858       91.913043  1641.548895
40. Empresa           2054.041132   3633.945019       99.458333  1579.903887
41. Empresa           1754.617526   3449.306873      103.586207  1694.689347
42. Empresa           2020.690722   3333.837985      108.681818  1313.147263
43. Empresa           2046.077499   3505.526330       98.310345  1459.448831
44. Empresa           2047.672587   3304.959589      101.678571  1257.287001
45. Empresa           2147.230676   3353.718508       95.218750  1206.487832
46. Empresa           1868.241375   3379.642234      102.375000  1511.400859
47. Empresa           2143.694346   3706.345229       93.800000  1562.650884
48. Empresa           1945.366569   3636.416519       95.066667  1691.049950
49. Empresa           1858.447113   3439.877243       98.966667  1581.430130
5. Empresa            1805.528041   3719.309882       97.096774  1913.781841
50. Empresa           2001.418825   3451.352333      102.482759  1449.933507
6. Empresa            1677.420276   3365.633879      101.894737  1688.213603
7. Empresa            1998.801732   3450.452335       86.789474  1451.650602
8. Empresa            1948.331062   3370.077042      103.966667  1421.745980
9. Empresa            1975.967561   3355.734194       97.666667  1379.766633

In [165]:
# Podemo ir além e obter mais informação
dfgroupby.aggregate({"Lucro ($)": [min, max, np.mean, np.std],
                     "Retorno ($R)": [min, max, np.mean],
                     "Transferencias": [min, max]})

               Lucro ($)                                        Retorno ($R)  \
                     min          max         mean          std          min
Empresas
1. Empresa  -1029.431080  3822.284944  1759.195898  1037.584319  2149.619527
10. Empresa -1030.443270  3453.502875  1050.207019  1148.871827  2087.910491
11. Empresa  -705.662450  3519.872560  1230.808427  1182.481833  2030.177115
12. Empresa  -714.737098  4381.339656  2095.511693  1404.498163  2141.494135
13. Empresa -1148.533275  3866.567488  1530.527352  1247.353711  2023.691796
14. Empresa   263.865646  3536.995386  1749.177821  1140.728316  2155.363780
15. Empresa  -728.587438  3619.623496  1341.274982  1016.592325  2092.543773
16. Empresa  -548.482080  3854.690724  1394.766049  1141.358305  2048.649844
17. Empresa -1240.827497  3706.601038  1483.612930  1365.839768  2062.882442
18. Empresa -1139.793413  3898.052797  1436.258210  1392.141829  2041.851256
19. Empresa  -967.249200  4304.251388  1347.612924  1337.228539  2090.616403
2. Empresa   -883.122069  3381.139297  1253.508910  1030.183136  2060.268599
20. Empresa  -709.179928  3861.244393  1444.473062  1270.134815  2137.958439
21. Empresa -1163.665628  4053.315337  1856.273986  1390.612954  2008.293371
22. Empresa  -543.915040  4273.109898  2015.293072  1212.567310  2273.814129
23. Empresa  -738.132762  3859.476037  1599.191738  1108.527709  2024.088235
24. Empresa   -47.141388  3855.958881  1805.489100  1144.374248  2225.454568
25. Empresa  -960.211852  4112.323860  1005.289291  1089.804077  2246.821725
26. Empresa  -958.524594  3942.799478  1679.567839  1304.625216  2121.032099
27. Empresa -1108.074933  4060.720706  1563.466589  1322.416047  2072.488042
28. Empresa  -842.914170  3723.406089  1675.341922  1074.297519  2255.857317
29. Empresa  -564.451356  3704.840235  1642.278628   959.337362  2096.997310
3. Empresa  -1349.945780  3513.125067  1298.500411  1085.185791  2125.007634
30. Empresa  -547.357292  3783.603822  1830.591973  1210.580710  2005.253313
31. Empresa  -953.008912  3978.940821  1758.334268  1364.969635  2117.992643
32. Empresa  -573.477903  3780.772436  1573.950805  1344.798607  2032.194612
33. Empresa  -815.591049  4243.023916  1300.017697  1116.483871  2019.803783
34. Empresa  -882.077914  3555.259062  1595.120062  1205.778173  2024.841120
35. Empresa  -687.538541  4011.018418  1692.621761  1169.129653  2068.895306
36. Empresa -1164.809573  3973.699581  1543.534789  1192.851715  2206.050355
37. Empresa -1140.223682  3460.427148  1494.117552  1123.597568  2081.650732
38. Empresa  -917.843962  3603.010118  1632.556271  1151.524851  2071.907721
39. Empresa -1019.210043  4206.259360  1636.320232  1266.210240  2007.410936
4. Empresa  -1223.418743  4292.834691  1641.548895  1266.265841  2019.902194
40. Empresa  -802.959433  3140.804591  1579.903887  1069.461029  2291.703842
41. Empresa  -401.786495  3996.657788  1694.689347  1050.189099  2047.466382
42. Empresa  -576.370588  3130.894568  1313.147263  1177.055003  2009.236221
43. Empresa -1404.915928  3564.670275  1459.448831  1420.751564  2030.213027
44. Empresa  -828.683235  3369.566484  1257.287001  1200.936169  2036.005019
45. Empresa -1445.807576  4163.383447  1206.487832  1252.420524  2039.718196
46. Empresa  -692.884152  3984.252404  1511.400859  1357.246694  2090.542099
47. Empresa  -706.070346  4167.823786  1562.650884  1351.350253  2180.342782
48. Empresa -1014.166405  4024.396892  1691.049950  1356.306780  2134.267348
49. Empresa -1061.499868  4196.441957  1581.430130  1269.798262  2051.334685
5. Empresa  -1265.669610  4086.839319  1913.781841  1283.815598  2046.316855
50. Empresa  -990.288601  3938.989383  1449.933507  1393.250156  2065.830055
6. Empresa   -727.564360  3567.506539  1688.213603  1149.383245  2089.353807
7. Empresa   -510.586105  3592.984526  1451.650602  1373.678412  2357.422076
8. Empresa   -118.846695  4034.418406  1421.745980  1065.229522  2032.403154
9. Empresa   -755.669977  4014.853833  1379.766633  1273.016471  2003.734967

                                      Transferencias
                     max         mean            min    max
Empresas
1. Empresa   4947.407586  3423.575079           50.0  146.0
10. Empresa  4851.489657  3190.926190           57.0  149.0
11. Empresa  4657.737047  3347.678176           52.0  145.0
12. Empresa  4996.272864  3958.437340           50.0  146.0
13. Empresa  4924.526302  3431.103574           53.0  142.0
14. Empresa  4896.790511  3647.238621           52.0  135.0
15. Empresa  4989.069570  3452.572584           55.0  139.0
16. Empresa  4985.187002  3351.897950           50.0  148.0
17. Empresa  4913.065603  3462.218560           56.0  149.0
18. Empresa  4963.369466  3371.061402           50.0  149.0
19. Empresa  4987.979475  3412.104318           56.0  149.0
2. Empresa   4978.045610  3203.329748           53.0  145.0
20. Empresa  4791.396088  3396.899169           61.0  143.0
21. Empresa  4939.484402  3796.087643           51.0  134.0
22. Empresa  4817.159746  3706.612504           51.0  145.0
23. Empresa  4890.610261  3530.172001           56.0  149.0
24. Empresa  4881.663741  3672.593560           52.0  140.0
25. Empresa  4851.375782  3284.652650           51.0  143.0
26. Empresa  4950.031443  3613.810166           53.0  149.0
27. Empresa  4917.998672  3466.481127           51.0  142.0
28. Empresa  4930.878173  3663.532360           56.0  146.0
29. Empresa  4921.828694  3692.853863           58.0  136.0
3. Empresa   4699.281767  3356.946477           52.0  144.0
30. Empresa  4941.148803  3482.426739           51.0  149.0
31. Empresa  4989.271695  3559.556194           51.0  142.0
32. Empresa  4878.639569  3683.589719           57.0  149.0
33. Empresa  4928.084245  3263.071559           54.0  149.0
34. Empresa  4956.482329  3645.419372           56.0  148.0
35. Empresa  4986.030796  3585.485089           54.0  147.0
36. Empresa  4869.855701  3627.044944           54.0  139.0
37. Empresa  4980.902269  3420.686900           55.0  145.0
38. Empresa  4771.791660  3552.188514           50.0  145.0
39. Empresa  4846.713070  3324.487385           50.0  149.0
4. Empresa   4975.332227  3559.867858           50.0  148.0
40. Empresa  4931.527367  3633.945019           58.0  145.0
41. Empresa  4707.675550  3449.306873           54.0  149.0
42. Empresa  4938.360410  3333.837985           60.0  149.0
43. Empresa  4991.164557  3505.526330           50.0  149.0
44. Empresa  4957.262265  3304.959589           56.0  147.0
45. Empresa  4993.935058  3353.718508           51.0  147.0
46. Empresa  4836.825999  3379.642234           50.0  149.0
47. Empresa  4985.800354  3706.345229           52.0  143.0
48. Empresa  4859.556661  3636.416519           55.0  146.0
49. Empresa  4917.103135  3439.877243           50.0  147.0
5. Empresa   4899.207193  3719.309882           55.0  147.0
50. Empresa  4978.907441  3451.352333           53.0  143.0
6. Empresa   4791.384550  3365.633879           55.0  146.0
7. Empresa   4573.603518  3450.452335           52.0  130.0
8. Empresa   4795.585638  3370.077042           51.0  148.0
9. Empresa   4990.171487  3355.734194           53.0  147.0

In [199]:
# Exemplo com dados de lingaugems de programação
df_ling = pd.read_csv("./Dados/programming_languages.csv")
df_ling

    year                    language
0   1951  Regional Assembly Language
1   1952                    Autocode
2   1954                         IPL
3   1955                  FLOW-MATIC
4   1957                     FORTRAN
..   ...                         ...
68  2011                      Kotlin
69  2011                         Red
70  2011                      Elixir
71  2012                       Julia
72  2014                       Swift

[73 rows x 2 columns]

In [174]:
df_lig_grop = df_ling.groupby(by="year")

In [201]:
# Obtendo um dataframe com as linguagens criadas em cada
df_lig_grop["language"].apply(','.join)

year
1951                 Regional Assembly Language
1952                                   Autocode
1954                                        IPL
1955                                 FLOW-MATIC
1957                            FORTRAN,COMTRAN
1958                              LISP,ALGOL 58
1959                             FACT,COBOL,RPG
1962                          APL,Simula,SNOBOL
1963                                        CPL
1964                       Speakeasy,BASIC,PL/I
1966                                       JOSS
1967                                       BCPL
1968                                       Logo
1969                                          B
1970                               Pascal,Forth
1972                         C,Smalltalk,Prolog
1973                                         ML
1975                                     Scheme
1978                                       SQL
1980                                       C++
1983                                        Ada
1984               Common Lisp,MATLAB,dBase III
1985                                     Eiffel
1986                Objective-C,LabVIEW ,Erlang
1987                                       Perl
1988                      Tcl,Wolfram Language
1989                                        FL
1990                                    Haskell
1991                        Python,Visual Basic
1993                                      Lua,R
1994                                      CLOS
1995    Ruby,Ada 95,Java,Delphi ,JavaScript,PHP
1997                                      Rebol
2000                               ActionScript
2001                                       C#,D
2002                                    Scratch
2003                               Groovy,Scala
2005                                         F#
2006                                 PowerShell
2007                                    Clojure
2009                                         Go
2010                                       Rust
2011                     Dart,Kotlin,Red,Elixir
2012                                      Julia
2014                                      Swift
Name: language, dtype: object

In [208]:
# Obtendo um dataframe com as linguagens criadas em cada
df_lig_grop["language"].apply(len)

year
1951    1
1952    1
1954    1
1955    1
1957    2
1958    2
1959    3
1962    3
1963    1
1964    3
1966    1
1967    1
1968    1
1969    1
1970    2
1972    3
1973    1
1975    1
1978    1
1980    1
1983    1
1984    3
1985    1
1986    3
1987    1
1988    2
1989    1
1990    1
1991    2
1993    2
1994    1
1995    6
1997    1
2000    1
2001    2
2002    1
2003    2
2005    1
2006    1
2007    1
2009    1
2010    1
2011    4
2012    1
2014    1
Name: language, dtype: int64